Repository: steventsao/byot
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: This server provides a trimmed preview. Add the whole file as context.
zh_hans: 此服务器提供的是截断后的预览。请将整个文件添加为上下文。

source: This server uses plain HTTP, so the password and your sessions can be read by others on this network. Use HTTPS, such as Tailscale Serve, on shared Wi-Fi.
zh_hans: 此服务器使用明文 HTTP，因此此网络上的其他人可以读取密码和你的会话。在共享 Wi-Fi 上请使用 HTTPS，例如 Tailscale Serve。

source: This server was removed from byot. Add it again to open its sessions.
zh_hans: 此服务器已从 byot 中移除。请重新添加以打开其会话。

source: This server was removed from byot. Choose another.
zh_hans: 此服务器已从 byot 中移除。请选择其他服务器。

source: Tilde
zh_hans: 波浪号

source: Timed out
zh_hans: 已超时

source: Title
zh_hans: 标题

source: To dictate messages, turn on Microphone for byot in Settings.
zh_hans: 要听写消息，请在“设置”中为 byot 开启“麦克风”。

source: To turn your speech into message text, turn on Speech Recognition for byot in Settings.
zh_hans: 要将语音转换为消息文本，请在“设置”中为 byot 开启“语音识别”。

source: Token counts and cost appear after the first reply.
zh_hans: token 数量和费用将在第一条回复后显示。

source: Tokens
zh_hans: Token

source: Tool
zh_hans: 工具

source: Tool activity
zh_hans: 工具活动

source: Tool details
zh_hans: 工具详细信息

source: Totals for this conversation’s replies. Subagent sessions keep their own totals.
zh_hans: 此对话中回复的总计。子智能体会话各自保留自己的总计。

source: Touch and hold a word, then adjust the selection handles to copy part of the response.
zh_hans: 按住一个字词，然后调整选择手柄以拷贝回复的一部分。

source: Transcribed by Apple
zh_hans: 由 Apple 转写

source: Transcript copied
zh_hans: 已拷贝对话记录

source: Try again
zh_hans: 重试

source: Turn
zh_hans: 轮次

source: Turn complete
zh_hans: 本轮已完成

source: Turn failed
zh_hans: 本轮失败

source: Turn stopped
zh_hans: 本轮已停止

source: Typed model ID
zh_hans: 输入的模型 ID

source: Typography
zh_hans: 字体排印

source: Uncommitted
zh_hans: 未提交

source: Uncommitted changes in the working tree.
zh_hans: 工作树中未提交的更改。

source: Uncommitted changes on %@.
zh_hans: %@ 上未提交的更改。

source: Unconfirmed
zh_hans: 未确认

source: Undo
zh_hans: 撤销

source: Undo asks OpenCode to rewind history and available file snapshots. Queued prompts are paused for review.
zh_hans: 撤销会请求 OpenCode 回退历史记录和可用的文件快照。排队的提示词已暂停，等待你查看。

source: Undo changes the conversation history. Files remain unchanged. Queued prompts are paused for review.
zh_hans: 撤销会更改对话历史记录，文件保持不变。排队的提示词已暂停，等待你查看。

source: Undo last turn
zh_hans: 撤销上一轮

source: Undo to this command
zh_hans: 撤销到此命令

source: Undo to this prompt
zh_hans: 撤销到此提示词

source: Unmute notifications
zh_hans: 取消静音通知

source: Unpublish
zh_hans: 取消发布

source: Unpublish this conversation?
zh_hans: 要取消发布此对话吗？

source: Unpublished. The conversation is private.
zh_hans: 已取消发布。此对话现为私密。

source: Unpublishing…
zh_hans: 正在取消发布…

source: Unsupported
zh_hans: 不支持

source: Untitled session
zh_hans: 未命名会话

source: Up arrow
zh_hans: 上箭头

source: Up one folder
zh_hans: 上一级文件夹

source: Update tasks
zh_hans: 更新任务

source: Update the computer companion using the setup command in Notifications settings, then check again.
zh_hans: 请使用“通知”设置中的设置命令更新电脑端配套程序，然后再次检查。

source: Updated %@
zh_hans: 更新于 %@

source: Updates
zh_hans: 更新

source: Updating
zh_hans: 正在更新

source: Uploading to queue
zh_hans: 正在上传到队列

source: Usage updates after the next reply.
zh_hans: 用量将在下一条回复后更新。

source: Use phone queue instead
zh_hans: 改用手机队列

source: Use “%@”
zh_hans: 使用“%@”

source: Username
zh_hans: 用户名

source: Using OpenCode’s defaults
zh_hans: 使用 OpenCode 的默认设置

source: Version
zh_hans: 版本

source: Version control
zh_hans: 版本控制

source: Vertical bar
zh_hans: 竖线

source: View configuration
zh_hans: 查看配置

source: View page
zh_hans: 查看页面

source: Visibility
zh_hans: 可见性

source: Wait for the current command to finish.
zh_hans: 请等待当前命令完成。

source: Wait for the current request to finish.
zh_hans: 请等待当前请求完成。

source: Wait for the queue to finish syncing.
zh_hans: 请等待队列完成同步。

source: Wait for the session to connect.
zh_hans: 请等待会话连接。

source: Waiting
zh_hans: 等待中

source: Waiting for Apple to register this device. Try again in a moment.
zh_hans: 正在等待 Apple 注册此设备。请稍后重试。

source: Waiting for the notification companion to connect.
zh_hans: 正在等待通知配套程序连接。

source: Waiting to retry
zh_hans: 等待重试

source: What should OpenCode do?
zh_hans: 要让 OpenCode 做什么？

source: What this project runs with. Server settings change the defaults for every project. Secrets such as API keys are hidden.
zh_hans: 此项目运行时使用的配置。服务器设置会更改所有项目的默认值。API 密钥等机密信息已隐藏。

source: Which project should OpenCode work in?
zh_hans: 要让 OpenCode 在哪个项目中工作？

source: Which session?
zh_hans: 哪个会话？

source: While this OpenCode instance remains active, this allows %1$@ requests matching: %2$@ in this directory. The rule is kept in memory and is not persisted.
zh_hans: 在此 OpenCode 实例保持活跃期间，这会允许此目录中匹配以下内容的 %1$@ 请求：%2$@。该规则保存在内存中，不会持久保存。

source: While this OpenCode instance remains active, this allows every %@ request in this directory. The rule is kept in memory and is not persisted.
zh_hans: 在此 OpenCode 实例保持活跃期间，这会允许此目录中的所有 %@ 请求。该规则保存在内存中，不会持久保存。

source: Without snapshots, undo and revert can’t restore the agent’s file changes.
zh_hans: 没有快照时，撤销和还原无法恢复智能体对文件的更改。

source: Wordmark in Open Runde by Laurids Kern, based on Inter
zh_hans: 文字标志使用 Laurids Kern 基于 Inter 设计的 Open Runde 字体

source: Working
zh_hans: 工作中

source: Working directory
zh_hans: 工作目录

source: Working directory (optional)
zh_hans: 工作目录（可选）

source: Working tree is clean
zh_hans: 工作树是干净的

source: Works apart from the main checkout.
zh_hans: 在主检出之外工作。

source: Works in the project’s own checkout.
zh_hans: 在项目自身的检出中工作。

source: Works on %@, apart from the main checkout.
zh_hans: 在主检出之外的 %@ 上工作。

source: Workspace
zh_hans: 工作区

source: Workspace checkpoint %@
zh_hans: 工作区检查点 %@

source: Worktree
zh_hans: 工作树

source: Worktree %@
zh_hans: 工作树 %@

source: Worktree name (optional)
zh_hans: 工作树名称（可选）

source: Worktrees
zh_hans: 工作树

source: Worktrees aren’t available
zh_hans: 工作树不可用

source: Worktrees of %@
zh_hans: %@ 的工作树

# Worktrees of %@ (%lld)
source: Worktrees of %1$@ (%2$lld)
zh_hans: %1$@ 的工作树（%2$lld）

source: Wrap lines
zh_hans: 自动换行

source: Write file
zh_hans: 写入文件

source: Writing a reply
zh_hans: 正在撰写回复

source: Yes
zh_hans: 是

source: You
zh_hans: 你

source: Your answer
zh_hans: 你的答案

source: Your server couldn’t be reached or didn’t accept it. Open byot to try again.
zh_hans: 无法连接你的服务器，或服务器未接受。请打开 byot 重试。

source: a file
zh_hans: 一个文件

source: a link
zh_hans: 一个链接

source: an image
zh_hans: 一张图片

source: automatic server default
zh_hans: 自动 服务器默认

source: blank
zh_hans: 空行

source: branch %@
zh_hans: 分支 %@

source: byot adds this to the session’s message without sending it.
zh_hans: byot 会将其添加到会话的消息中，但不会发送。

source: byot can’t receive shared items right now. Update byot, then try again.
zh_hans: byot 目前无法接收分享的项目。请更新 byot，然后重试。

source: byot can’t search this network. Allow Local Network access for byot in Settings, then try again.
zh_hans: byot 无法搜索此网络。请在“设置”中允许 byot 访问本地网络，然后重试。

# byot can’t start sessions on %@. %@
source: byot can’t start sessions on %1$@. %2$@
zh_hans: byot 无法在 %1$@ 上开始会话。%2$@

source: byot couldn’t add this to that session’s message. Choose another session or try again.
zh_hans: byot 无法将其添加到该会话的消息中。请选择其他会话或重试。

source: byot couldn’t add what you shared to this session’s message. It’s kept for the next time you open byot.
zh_hans: byot 无法将你分享的内容添加到此会话的消息中。它会保留到你下次打开 byot 时。

source: byot fills in the address and sign-in from the code; nothing is saved until you tap Save.
zh_hans: byot 会根据配对码填入地址和登录信息；在你轻点“存储”之前不会保存任何内容。

source: byot uses the camera only to read the pairing code.
zh_hans: byot 仅使用相机读取配对码。

source: capabilities: %@
zh_hans: 功能：%@

# capabilities: %@, +%lld more
source: capabilities: %1$@, +%2$lld more
zh_hans: 功能：%1$@，另外 %2$lld 项

source: capabilities: advertised
zh_hans: 功能：已声明

source: capabilities: unavailable
zh_hans: 功能：不可用

source: changed files
zh_hans: 已更改的文件

source: code
zh_hans: 代码

source: cost %@
zh_hans: 费用 %@

source: create the worktree
zh_hans: 创建工作树

source: delete “%@”
zh_hans: 删除“%@”

source: file browsing
zh_hans: 文件浏览

source: file previews
zh_hans: 文件预览

source: file search
zh_hans: 文件搜索

source: in %@
zh_hans: 位于 %@

source: reset “%@”
zh_hans: 重置“%@”

source: running
zh_hans: 个正在运行

source: session needs you
zh_hans: 个会话需要你处理

source: sessions need you
zh_hans: 个会话需要你处理

source: sessions saved
zh_hans: 保存的会话

source: start a session in “%@”
zh_hans: 在“%@”中开始会话

source: terminal
zh_hans: 终端

source: text
zh_hans: 文本

source: the default branch
zh_hans: 默认分支

source: the session’s model
zh_hans: 会话的模型

source: this conversation as saved
zh_hans: 保存的此对话

source: unknown version
zh_hans: 未知版本

source: “%@” failed
zh_hans: “%@”失败了

source: “%@” is waiting for you
zh_hans: “%@”正在等你

# “%@” was created, but OpenCode couldn’t prepare it: %@
source: “%1$@” was created, but OpenCode couldn’t prepare it: %2$@
zh_hans: 已创建“%1$@”，但 OpenCode 无法完成准备：%2$@
